jmeter_test_plan_with_verification/temp_test.jmx
<jmeterTestPlan jmeter="2.11 r1554548" properties="2.6" version="1.2">
  <hashTree>
    <TestPlan enabled="true" guiclass="TestPlanGui" testclass="TestPlan" testname="TestPlanWIthVerificationCapability">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp elementType="Arguments" enabled="true" guiclass="ArgumentsPanel" name="TestPlan.user_defined_variables" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments" />
      </elementProp>
    </TestPlan>
    <hashTree>
      <TestFragmentController enabled="true" guiclass="TestFragmentControllerGui" testclass="TestFragmentController" testname="Test Scenario" />
      <hashTree>
        <kg.apc.jmeter.samplers.DummySampler enabled="true" guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="jp@gc - Dummy Sampler">
          <boolProp name="WAITING">true</boolProp>
          <boolProp name="SUCCESFULL">true</boolProp>
          <stringProp name="RESPONSE_CODE">200</stringProp>
          <stringProp name="RESPONSE_MESSAGE">OK</stringProp>
          <stringProp name="REQUEST_DATA">request</stringProp>
          <stringProp name="RESPONSE_DATA">response</stringProp>
          <stringProp name="RESPONSE_TIME">20</stringProp>
          <stringProp name="LATENCY">10</stringProp>
        </kg.apc.jmeter.samplers.DummySampler>
        <hashTree />
      </hashTree>
      <ThreadGroup enabled="True" guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Verify">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp elementType="LoopController" enabled="true" guiclass="LoopControlPanel" name="ThreadGroup.main_controller" testclass="LoopController" testname="Loop Controller">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1402744801000</longProp>
        <longProp name="ThreadGroup.end_time">1402744801000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <ModuleController enabled="true" guiclass="ModuleControllerGui" testclass="ModuleController" testname="Module Controller">
          <collectionProp name="ModuleController.node_path">
            <stringProp name="-1227702913">WorkBench</stringProp>
            <stringProp name="-1525281484">TestPlanWIthVerificationCapability</stringProp>
            <stringProp name="1044752222">Test Scenario</stringProp>
          </collectionProp>
        </ModuleController>
        <hashTree />
      </hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup enabled="False" guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="Load">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="-649852391">
            <stringProp name="100">100</stringProp>
            <stringProp name="53">5</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="1598">20</stringProp>
            <stringProp name="53">5</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp elementType="LoopController" enabled="true" guiclass="LoopControlPanel" name="ThreadGroup.main_controller" testclass="LoopController" testname="Loop Controller">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <ModuleController enabled="true" guiclass="ModuleControllerGui" testclass="ModuleController" testname="Module Controller">
          <collectionProp name="ModuleController.node_path">
            <stringProp name="-1227702913">WorkBench</stringProp>
            <stringProp name="-1525281484">TestPlanWIthVerificationCapability</stringProp>
            <stringProp name="1044752222">Test Scenario</stringProp>
          </collectionProp>
        </ModuleController>
        <hashTree />
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>